other_files/OpenFOAM_Sample_Files/outdoor_0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

// use pdf file to update this
gradSchemes
{
    default             Gauss linear;
	grad(U)				Gauss linear;
}

//low quality
divSchemes
{
    div(phi,U)          bounded Gauss upwind grad(U); 
    div(phi,epsilon)    bounded Gauss upwind default;
    div(phi,k)          bounded Gauss upwind default;
	div((nuEff*dev2(T(grad(U)))))    Gauss linear;
}

// high quality
//divSchemes
//{
//    div(phi,U)          bounded Gauss linearUpwind grad(U);
//    div(phi,epsilon)    bounded Gauss linearUpwind default;
//    div(phi,k)          bounded Gauss linearUpwind default;
//    div((nuEff*dev2(T(grad(U)))))    Gauss linear;
// }

// take from pdf
laplacianSchemes
{
    default             Gauss linear limited corrected 0.333;
}

// take from laplacianSchemes
interpolationSchemes
{
    default             linear limited;
}

// take from laplacianSchemes
snGradSchemes
{
    default             limited corrected 0.333;
}

fluxRequired
{
    default             no;
    p;
}


// ************************************************************************* //
